---
kind: enumMember
id: F:Autodesk.Revit.DB.FlowDirectionType.Bidirectional
enum: Autodesk.Revit.DB.FlowDirectionType
source: html/f32da4fd-b137-448c-0636-693f983c2b48.htm
---
# Autodesk.Revit.DB.FlowDirectionType.Bidirectional

Flow bidirectional